# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
- [12, 16, 19, 36, 40, 28]  # P3/8
- [36, 75, 76, 55, 72, 146]  # P4/16
- [142, 110, 192, 243, 459, 401]  # P5/32

# yolov7 backbone
backbone:
  [[-1, 1, Conv, [16, 3, 2, 1]],       #0
   [-1, 1, G_bneck, [16, 16, 3, 1]],

   [-1, 1, G_bneck, [24, 48, 3, 2]],
   [-1, 1, G_bneck, [24, 72, 3, 1]],

   [-1, 1, G_bneck, [40, 72, 3, 2, True]],
   [-1, 1, G_bneck, [40, 120, 3, 1, True]],

   [-1, 1, G_bneck, [80, 240, 3, 2]],
   [-1, 3, G_bneck, [80, 184, 3, 1]],
   [-1, 1, G_bneck, [112, 480, 3, 1, True]],
   [-1, 1, G_bneck, [112, 480, 3, 1, True]],

   [-1, 1, G_bneck, [160, 672, 3, 2, True]],
   [-1, 1, G_bneck, [160, 960, 3, 1]],
   [-1, 1, G_bneck, [160, 960, 3, 1, True]],
   [-1, 1, G_bneck, [160, 960, 3, 1]],
   [-1, 1, G_bneck, [160, 960, 3, 1, True]],
   [-1, 1, Conv, [960]],    #15
  ]

# yolov7 head
head:
  [ [ -1, 1, SPPCSPC, [ 512 ] ], # 51

    [ -1, 1, Conv, [ 256, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ 9, 1, Conv, [ 256, 1, 1 ] ], # route backbone P4
    [ [ -1, -2 ], 1, Concat, [ 1 ] ],

    [ -1, 1, Conv, [ 256, 1, 1 ] ],
    [ -2, 1, Conv, [ 256, 1, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 256, 1, 1 ] ], # 63

    [ -1, 1, Conv, [ 128, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ 5, 1, Conv, [ 128, 1, 1 ] ], # route backbone P3
    [ [ -1, -2 ], 1, Concat, [ 1 ] ],

    [ -1, 1, Conv, [ 128, 1, 1 ] ],
    [ -2, 1, Conv, [ 128, 1, 1 ] ],
    [ -1, 1, Conv, [ 64, 3, 1 ] ],
    [ -1, 1, Conv, [ 64, 3, 1 ] ],
    [ -1, 1, Conv, [ 64, 3, 1 ] ],
    [ -1, 1, Conv, [ 64, 3, 1 ] ],
    [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 128, 1, 1 ] ], # 75

    [ -1, 1, MP, [ ] ],
    [ -1, 1, Conv, [ 128, 1, 1 ] ],
    [ -3, 1, Conv, [ 128, 1, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 2 ] ],
    [ [ -1, -3, 28 ], 1, Concat, [ 1 ] ],

    [ -1, 1, Conv, [ 256, 1, 1 ] ],
    [ -2, 1, Conv, [ 256, 1, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 256, 1, 1 ] ], # 88

    [ -1, 1, MP, [ ] ],
    [ -1, 1, Conv, [ 256, 1, 1 ] ],
    [ -3, 1, Conv, [ 256, 1, 1 ] ],
    [ -1, 1, Conv, [ 256, 3, 2 ] ],
    [ [ -1, -3, 16 ], 1, Concat, [ 1 ] ],

    [ -1, 1, Conv, [ 512, 1, 1 ] ],
    [ -2, 1, Conv, [ 512, 1, 1 ] ],
    [ -1, 1, Conv, [ 256, 3, 1 ] ],
    [ -1, 1, Conv, [ 256, 3, 1 ] ],
    [ -1, 1, Conv, [ 256, 3, 1 ] ],
    [-1, 1, BRSA_Bottleneck, [256]],
#    [ -1, 1, Conv, [ 256, 3, 1 ] ],
    [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 512, 1, 1 ] ], # 101

    [ 40, 1, RepConv, [ 256, 3, 1 ] ],
    [ 53, 1, RepConv, [ 512, 3, 1 ] ],
    [ 66, 1, RepConv, [ 1024, 3, 1 ] ],

    [ [ 67,68,69 ], 1, IDetect, [ nc, anchors ] ],   # Detect(P3, P4, P5)
  ]